name: "ACTdetector_UCFSports_FLOW5_deploy"
input: "data_stream0flow"
input: "data_stream1flow"
input: "data_stream2flow"
input: "data_stream3flow"
input: "data_stream4flow"
input: "data_stream5flow"
input_shape {
  dim: 1
  dim: 15
  dim: 300
  dim: 300
}
input_shape {
  dim: 1
  dim: 15
  dim: 300
  dim: 300
}
input_shape {
  dim: 1
  dim: 15
  dim: 300
  dim: 300
}
input_shape {
  dim: 1
  dim: 15
  dim: 300
  dim: 300
}
input_shape {
  dim: 1
  dim: 15
  dim: 300
  dim: 300
}
input_shape {
  dim: 1
  dim: 15
  dim: 300
  dim: 300
}
layer {
  name: "conv1_1_stream0flow"
  type: "Convolution"
  bottom: "data_stream0flow"
  top: "conv1_1_stream0flow"
  param {
    name: "conv1_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv1_1_stream1flow"
  type: "Convolution"
  bottom: "data_stream1flow"
  top: "conv1_1_stream1flow"
  param {
    name: "conv1_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv1_1_stream2flow"
  type: "Convolution"
  bottom: "data_stream2flow"
  top: "conv1_1_stream2flow"
  param {
    name: "conv1_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv1_1_stream3flow"
  type: "Convolution"
  bottom: "data_stream3flow"
  top: "conv1_1_stream3flow"
  param {
    name: "conv1_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv1_1_stream4flow"
  type: "Convolution"
  bottom: "data_stream4flow"
  top: "conv1_1_stream4flow"
  param {
    name: "conv1_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv1_1_stream5flow"
  type: "Convolution"
  bottom: "data_stream5flow"
  top: "conv1_1_stream5flow"
  param {
    name: "conv1_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_1_stream0flow"
  type: "ReLU"
  bottom: "conv1_1_stream0flow"
  top: "conv1_1_stream0flow"
}
layer {
  name: "conv1_2_stream0flow"
  type: "Convolution"
  bottom: "conv1_1_stream0flow"
  top: "conv1_2_stream0flow"
  param {
    name: "conv1_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_2_stream0flow"
  type: "ReLU"
  bottom: "conv1_2_stream0flow"
  top: "conv1_2_stream0flow"
}
layer {
  name: "relu1_1_stream1flow"
  type: "ReLU"
  bottom: "conv1_1_stream1flow"
  top: "conv1_1_stream1flow"
}
layer {
  name: "conv1_2_stream1flow"
  type: "Convolution"
  bottom: "conv1_1_stream1flow"
  top: "conv1_2_stream1flow"
  param {
    name: "conv1_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_2_stream1flow"
  type: "ReLU"
  bottom: "conv1_2_stream1flow"
  top: "conv1_2_stream1flow"
}
layer {
  name: "relu1_1_stream2flow"
  type: "ReLU"
  bottom: "conv1_1_stream2flow"
  top: "conv1_1_stream2flow"
}
layer {
  name: "conv1_2_stream2flow"
  type: "Convolution"
  bottom: "conv1_1_stream2flow"
  top: "conv1_2_stream2flow"
  param {
    name: "conv1_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_2_stream2flow"
  type: "ReLU"
  bottom: "conv1_2_stream2flow"
  top: "conv1_2_stream2flow"
}
layer {
  name: "relu1_1_stream3flow"
  type: "ReLU"
  bottom: "conv1_1_stream3flow"
  top: "conv1_1_stream3flow"
}
layer {
  name: "conv1_2_stream3flow"
  type: "Convolution"
  bottom: "conv1_1_stream3flow"
  top: "conv1_2_stream3flow"
  param {
    name: "conv1_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_2_stream3flow"
  type: "ReLU"
  bottom: "conv1_2_stream3flow"
  top: "conv1_2_stream3flow"
}
layer {
  name: "relu1_1_stream4flow"
  type: "ReLU"
  bottom: "conv1_1_stream4flow"
  top: "conv1_1_stream4flow"
}
layer {
  name: "conv1_2_stream4flow"
  type: "Convolution"
  bottom: "conv1_1_stream4flow"
  top: "conv1_2_stream4flow"
  param {
    name: "conv1_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_2_stream4flow"
  type: "ReLU"
  bottom: "conv1_2_stream4flow"
  top: "conv1_2_stream4flow"
}
layer {
  name: "relu1_1_stream5flow"
  type: "ReLU"
  bottom: "conv1_1_stream5flow"
  top: "conv1_1_stream5flow"
}
layer {
  name: "conv1_2_stream5flow"
  type: "Convolution"
  bottom: "conv1_1_stream5flow"
  top: "conv1_2_stream5flow"
  param {
    name: "conv1_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_2_stream5flow"
  type: "ReLU"
  bottom: "conv1_2_stream5flow"
  top: "conv1_2_stream5flow"
}
layer {
  name: "pool1_stream0flow"
  type: "Pooling"
  bottom: "conv1_2_stream0flow"
  top: "pool1_stream0flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool1_stream1flow"
  type: "Pooling"
  bottom: "conv1_2_stream1flow"
  top: "pool1_stream1flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool1_stream2flow"
  type: "Pooling"
  bottom: "conv1_2_stream2flow"
  top: "pool1_stream2flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool1_stream3flow"
  type: "Pooling"
  bottom: "conv1_2_stream3flow"
  top: "pool1_stream3flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool1_stream4flow"
  type: "Pooling"
  bottom: "conv1_2_stream4flow"
  top: "pool1_stream4flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool1_stream5flow"
  type: "Pooling"
  bottom: "conv1_2_stream5flow"
  top: "pool1_stream5flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1_stream0flow"
  type: "Convolution"
  bottom: "pool1_stream0flow"
  top: "conv2_1_stream0flow"
  param {
    name: "conv2_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1_stream0flow"
  type: "ReLU"
  bottom: "conv2_1_stream0flow"
  top: "conv2_1_stream0flow"
}
layer {
  name: "conv2_1_stream1flow"
  type: "Convolution"
  bottom: "pool1_stream1flow"
  top: "conv2_1_stream1flow"
  param {
    name: "conv2_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1_stream1flow"
  type: "ReLU"
  bottom: "conv2_1_stream1flow"
  top: "conv2_1_stream1flow"
}
layer {
  name: "conv2_1_stream2flow"
  type: "Convolution"
  bottom: "pool1_stream2flow"
  top: "conv2_1_stream2flow"
  param {
    name: "conv2_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1_stream2flow"
  type: "ReLU"
  bottom: "conv2_1_stream2flow"
  top: "conv2_1_stream2flow"
}
layer {
  name: "conv2_1_stream3flow"
  type: "Convolution"
  bottom: "pool1_stream3flow"
  top: "conv2_1_stream3flow"
  param {
    name: "conv2_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1_stream3flow"
  type: "ReLU"
  bottom: "conv2_1_stream3flow"
  top: "conv2_1_stream3flow"
}
layer {
  name: "conv2_1_stream4flow"
  type: "Convolution"
  bottom: "pool1_stream4flow"
  top: "conv2_1_stream4flow"
  param {
    name: "conv2_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1_stream4flow"
  type: "ReLU"
  bottom: "conv2_1_stream4flow"
  top: "conv2_1_stream4flow"
}
layer {
  name: "conv2_1_stream5flow"
  type: "Convolution"
  bottom: "pool1_stream5flow"
  top: "conv2_1_stream5flow"
  param {
    name: "conv2_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1_stream5flow"
  type: "ReLU"
  bottom: "conv2_1_stream5flow"
  top: "conv2_1_stream5flow"
}
layer {
  name: "conv2_2_stream0flow"
  type: "Convolution"
  bottom: "conv2_1_stream0flow"
  top: "conv2_2_stream0flow"
  param {
    name: "conv2_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_2_stream0flow"
  type: "ReLU"
  bottom: "conv2_2_stream0flow"
  top: "conv2_2_stream0flow"
}
layer {
  name: "conv2_2_stream1flow"
  type: "Convolution"
  bottom: "conv2_1_stream1flow"
  top: "conv2_2_stream1flow"
  param {
    name: "conv2_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_2_stream1flow"
  type: "ReLU"
  bottom: "conv2_2_stream1flow"
  top: "conv2_2_stream1flow"
}
layer {
  name: "conv2_2_stream2flow"
  type: "Convolution"
  bottom: "conv2_1_stream2flow"
  top: "conv2_2_stream2flow"
  param {
    name: "conv2_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_2_stream2flow"
  type: "ReLU"
  bottom: "conv2_2_stream2flow"
  top: "conv2_2_stream2flow"
}
layer {
  name: "conv2_2_stream3flow"
  type: "Convolution"
  bottom: "conv2_1_stream3flow"
  top: "conv2_2_stream3flow"
  param {
    name: "conv2_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_2_stream3flow"
  type: "ReLU"
  bottom: "conv2_2_stream3flow"
  top: "conv2_2_stream3flow"
}
layer {
  name: "conv2_2_stream4flow"
  type: "Convolution"
  bottom: "conv2_1_stream4flow"
  top: "conv2_2_stream4flow"
  param {
    name: "conv2_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_2_stream4flow"
  type: "ReLU"
  bottom: "conv2_2_stream4flow"
  top: "conv2_2_stream4flow"
}
layer {
  name: "conv2_2_stream5flow"
  type: "Convolution"
  bottom: "conv2_1_stream5flow"
  top: "conv2_2_stream5flow"
  param {
    name: "conv2_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_2_stream5flow"
  type: "ReLU"
  bottom: "conv2_2_stream5flow"
  top: "conv2_2_stream5flow"
}
layer {
  name: "pool2_stream0flow"
  type: "Pooling"
  bottom: "conv2_2_stream0flow"
  top: "pool2_stream0flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool2_stream1flow"
  type: "Pooling"
  bottom: "conv2_2_stream1flow"
  top: "pool2_stream1flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool2_stream2flow"
  type: "Pooling"
  bottom: "conv2_2_stream2flow"
  top: "pool2_stream2flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool2_stream3flow"
  type: "Pooling"
  bottom: "conv2_2_stream3flow"
  top: "pool2_stream3flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool2_stream4flow"
  type: "Pooling"
  bottom: "conv2_2_stream4flow"
  top: "pool2_stream4flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool2_stream5flow"
  type: "Pooling"
  bottom: "conv2_2_stream5flow"
  top: "pool2_stream5flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1_stream0flow"
  type: "Convolution"
  bottom: "pool2_stream0flow"
  top: "conv3_1_stream0flow"
  param {
    name: "conv3_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1_stream0flow"
  type: "ReLU"
  bottom: "conv3_1_stream0flow"
  top: "conv3_1_stream0flow"
}
layer {
  name: "conv3_1_stream1flow"
  type: "Convolution"
  bottom: "pool2_stream1flow"
  top: "conv3_1_stream1flow"
  param {
    name: "conv3_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1_stream1flow"
  type: "ReLU"
  bottom: "conv3_1_stream1flow"
  top: "conv3_1_stream1flow"
}
layer {
  name: "conv3_1_stream2flow"
  type: "Convolution"
  bottom: "pool2_stream2flow"
  top: "conv3_1_stream2flow"
  param {
    name: "conv3_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1_stream2flow"
  type: "ReLU"
  bottom: "conv3_1_stream2flow"
  top: "conv3_1_stream2flow"
}
layer {
  name: "conv3_1_stream3flow"
  type: "Convolution"
  bottom: "pool2_stream3flow"
  top: "conv3_1_stream3flow"
  param {
    name: "conv3_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1_stream3flow"
  type: "ReLU"
  bottom: "conv3_1_stream3flow"
  top: "conv3_1_stream3flow"
}
layer {
  name: "conv3_1_stream4flow"
  type: "Convolution"
  bottom: "pool2_stream4flow"
  top: "conv3_1_stream4flow"
  param {
    name: "conv3_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1_stream4flow"
  type: "ReLU"
  bottom: "conv3_1_stream4flow"
  top: "conv3_1_stream4flow"
}
layer {
  name: "conv3_1_stream5flow"
  type: "Convolution"
  bottom: "pool2_stream5flow"
  top: "conv3_1_stream5flow"
  param {
    name: "conv3_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1_stream5flow"
  type: "ReLU"
  bottom: "conv3_1_stream5flow"
  top: "conv3_1_stream5flow"
}
layer {
  name: "conv3_2_stream0flow"
  type: "Convolution"
  bottom: "conv3_1_stream0flow"
  top: "conv3_2_stream0flow"
  param {
    name: "conv3_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2_stream0flow"
  type: "ReLU"
  bottom: "conv3_2_stream0flow"
  top: "conv3_2_stream0flow"
}
layer {
  name: "conv3_2_stream1flow"
  type: "Convolution"
  bottom: "conv3_1_stream1flow"
  top: "conv3_2_stream1flow"
  param {
    name: "conv3_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2_stream1flow"
  type: "ReLU"
  bottom: "conv3_2_stream1flow"
  top: "conv3_2_stream1flow"
}
layer {
  name: "conv3_2_stream2flow"
  type: "Convolution"
  bottom: "conv3_1_stream2flow"
  top: "conv3_2_stream2flow"
  param {
    name: "conv3_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2_stream2flow"
  type: "ReLU"
  bottom: "conv3_2_stream2flow"
  top: "conv3_2_stream2flow"
}
layer {
  name: "conv3_2_stream3flow"
  type: "Convolution"
  bottom: "conv3_1_stream3flow"
  top: "conv3_2_stream3flow"
  param {
    name: "conv3_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2_stream3flow"
  type: "ReLU"
  bottom: "conv3_2_stream3flow"
  top: "conv3_2_stream3flow"
}
layer {
  name: "conv3_2_stream4flow"
  type: "Convolution"
  bottom: "conv3_1_stream4flow"
  top: "conv3_2_stream4flow"
  param {
    name: "conv3_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2_stream4flow"
  type: "ReLU"
  bottom: "conv3_2_stream4flow"
  top: "conv3_2_stream4flow"
}
layer {
  name: "conv3_2_stream5flow"
  type: "Convolution"
  bottom: "conv3_1_stream5flow"
  top: "conv3_2_stream5flow"
  param {
    name: "conv3_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2_stream5flow"
  type: "ReLU"
  bottom: "conv3_2_stream5flow"
  top: "conv3_2_stream5flow"
}
layer {
  name: "conv3_3_stream0flow"
  type: "Convolution"
  bottom: "conv3_2_stream0flow"
  top: "conv3_3_stream0flow"
  param {
    name: "conv3_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_3_stream0flow"
  type: "ReLU"
  bottom: "conv3_3_stream0flow"
  top: "conv3_3_stream0flow"
}
layer {
  name: "conv3_3_stream1flow"
  type: "Convolution"
  bottom: "conv3_2_stream1flow"
  top: "conv3_3_stream1flow"
  param {
    name: "conv3_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_3_stream1flow"
  type: "ReLU"
  bottom: "conv3_3_stream1flow"
  top: "conv3_3_stream1flow"
}
layer {
  name: "conv3_3_stream2flow"
  type: "Convolution"
  bottom: "conv3_2_stream2flow"
  top: "conv3_3_stream2flow"
  param {
    name: "conv3_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_3_stream2flow"
  type: "ReLU"
  bottom: "conv3_3_stream2flow"
  top: "conv3_3_stream2flow"
}
layer {
  name: "conv3_3_stream3flow"
  type: "Convolution"
  bottom: "conv3_2_stream3flow"
  top: "conv3_3_stream3flow"
  param {
    name: "conv3_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_3_stream3flow"
  type: "ReLU"
  bottom: "conv3_3_stream3flow"
  top: "conv3_3_stream3flow"
}
layer {
  name: "conv3_3_stream4flow"
  type: "Convolution"
  bottom: "conv3_2_stream4flow"
  top: "conv3_3_stream4flow"
  param {
    name: "conv3_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_3_stream4flow"
  type: "ReLU"
  bottom: "conv3_3_stream4flow"
  top: "conv3_3_stream4flow"
}
layer {
  name: "conv3_3_stream5flow"
  type: "Convolution"
  bottom: "conv3_2_stream5flow"
  top: "conv3_3_stream5flow"
  param {
    name: "conv3_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_3_stream5flow"
  type: "ReLU"
  bottom: "conv3_3_stream5flow"
  top: "conv3_3_stream5flow"
}
layer {
  name: "pool3_stream0flow"
  type: "Pooling"
  bottom: "conv3_3_stream0flow"
  top: "pool3_stream0flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool3_stream1flow"
  type: "Pooling"
  bottom: "conv3_3_stream1flow"
  top: "pool3_stream1flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool3_stream2flow"
  type: "Pooling"
  bottom: "conv3_3_stream2flow"
  top: "pool3_stream2flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool3_stream3flow"
  type: "Pooling"
  bottom: "conv3_3_stream3flow"
  top: "pool3_stream3flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool3_stream4flow"
  type: "Pooling"
  bottom: "conv3_3_stream4flow"
  top: "pool3_stream4flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool3_stream5flow"
  type: "Pooling"
  bottom: "conv3_3_stream5flow"
  top: "pool3_stream5flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1_stream0flow"
  type: "Convolution"
  bottom: "pool3_stream0flow"
  top: "conv4_1_stream0flow"
  param {
    name: "conv4_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1_stream0flow"
  type: "ReLU"
  bottom: "conv4_1_stream0flow"
  top: "conv4_1_stream0flow"
}
layer {
  name: "conv4_1_stream1flow"
  type: "Convolution"
  bottom: "pool3_stream1flow"
  top: "conv4_1_stream1flow"
  param {
    name: "conv4_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1_stream1flow"
  type: "ReLU"
  bottom: "conv4_1_stream1flow"
  top: "conv4_1_stream1flow"
}
layer {
  name: "conv4_1_stream2flow"
  type: "Convolution"
  bottom: "pool3_stream2flow"
  top: "conv4_1_stream2flow"
  param {
    name: "conv4_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1_stream2flow"
  type: "ReLU"
  bottom: "conv4_1_stream2flow"
  top: "conv4_1_stream2flow"
}
layer {
  name: "conv4_1_stream3flow"
  type: "Convolution"
  bottom: "pool3_stream3flow"
  top: "conv4_1_stream3flow"
  param {
    name: "conv4_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1_stream3flow"
  type: "ReLU"
  bottom: "conv4_1_stream3flow"
  top: "conv4_1_stream3flow"
}
layer {
  name: "conv4_1_stream4flow"
  type: "Convolution"
  bottom: "pool3_stream4flow"
  top: "conv4_1_stream4flow"
  param {
    name: "conv4_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1_stream4flow"
  type: "ReLU"
  bottom: "conv4_1_stream4flow"
  top: "conv4_1_stream4flow"
}
layer {
  name: "conv4_1_stream5flow"
  type: "Convolution"
  bottom: "pool3_stream5flow"
  top: "conv4_1_stream5flow"
  param {
    name: "conv4_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1_stream5flow"
  type: "ReLU"
  bottom: "conv4_1_stream5flow"
  top: "conv4_1_stream5flow"
}
layer {
  name: "conv4_2_stream0flow"
  type: "Convolution"
  bottom: "conv4_1_stream0flow"
  top: "conv4_2_stream0flow"
  param {
    name: "conv4_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2_stream0flow"
  type: "ReLU"
  bottom: "conv4_2_stream0flow"
  top: "conv4_2_stream0flow"
}
layer {
  name: "conv4_2_stream1flow"
  type: "Convolution"
  bottom: "conv4_1_stream1flow"
  top: "conv4_2_stream1flow"
  param {
    name: "conv4_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2_stream1flow"
  type: "ReLU"
  bottom: "conv4_2_stream1flow"
  top: "conv4_2_stream1flow"
}
layer {
  name: "conv4_2_stream2flow"
  type: "Convolution"
  bottom: "conv4_1_stream2flow"
  top: "conv4_2_stream2flow"
  param {
    name: "conv4_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2_stream2flow"
  type: "ReLU"
  bottom: "conv4_2_stream2flow"
  top: "conv4_2_stream2flow"
}
layer {
  name: "conv4_2_stream3flow"
  type: "Convolution"
  bottom: "conv4_1_stream3flow"
  top: "conv4_2_stream3flow"
  param {
    name: "conv4_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2_stream3flow"
  type: "ReLU"
  bottom: "conv4_2_stream3flow"
  top: "conv4_2_stream3flow"
}
layer {
  name: "conv4_2_stream4flow"
  type: "Convolution"
  bottom: "conv4_1_stream4flow"
  top: "conv4_2_stream4flow"
  param {
    name: "conv4_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2_stream4flow"
  type: "ReLU"
  bottom: "conv4_2_stream4flow"
  top: "conv4_2_stream4flow"
}
layer {
  name: "conv4_2_stream5flow"
  type: "Convolution"
  bottom: "conv4_1_stream5flow"
  top: "conv4_2_stream5flow"
  param {
    name: "conv4_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2_stream5flow"
  type: "ReLU"
  bottom: "conv4_2_stream5flow"
  top: "conv4_2_stream5flow"
}
layer {
  name: "conv4_3_stream0flow"
  type: "Convolution"
  bottom: "conv4_2_stream0flow"
  top: "conv4_3_stream0flow"
  param {
    name: "conv4_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_3_stream0flow"
  type: "ReLU"
  bottom: "conv4_3_stream0flow"
  top: "conv4_3_stream0flow"
}
layer {
  name: "conv4_3_stream1flow"
  type: "Convolution"
  bottom: "conv4_2_stream1flow"
  top: "conv4_3_stream1flow"
  param {
    name: "conv4_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_3_stream1flow"
  type: "ReLU"
  bottom: "conv4_3_stream1flow"
  top: "conv4_3_stream1flow"
}
layer {
  name: "conv4_3_stream2flow"
  type: "Convolution"
  bottom: "conv4_2_stream2flow"
  top: "conv4_3_stream2flow"
  param {
    name: "conv4_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_3_stream2flow"
  type: "ReLU"
  bottom: "conv4_3_stream2flow"
  top: "conv4_3_stream2flow"
}
layer {
  name: "conv4_3_stream3flow"
  type: "Convolution"
  bottom: "conv4_2_stream3flow"
  top: "conv4_3_stream3flow"
  param {
    name: "conv4_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_3_stream3flow"
  type: "ReLU"
  bottom: "conv4_3_stream3flow"
  top: "conv4_3_stream3flow"
}
layer {
  name: "conv4_3_stream4flow"
  type: "Convolution"
  bottom: "conv4_2_stream4flow"
  top: "conv4_3_stream4flow"
  param {
    name: "conv4_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_3_stream4flow"
  type: "ReLU"
  bottom: "conv4_3_stream4flow"
  top: "conv4_3_stream4flow"
}
layer {
  name: "conv4_3_stream5flow"
  type: "Convolution"
  bottom: "conv4_2_stream5flow"
  top: "conv4_3_stream5flow"
  param {
    name: "conv4_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_3_stream5flow"
  type: "ReLU"
  bottom: "conv4_3_stream5flow"
  top: "conv4_3_stream5flow"
}
layer {
  name: "pool4_stream0flow"
  type: "Pooling"
  bottom: "conv4_3_stream0flow"
  top: "pool4_stream0flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool4_stream1flow"
  type: "Pooling"
  bottom: "conv4_3_stream1flow"
  top: "pool4_stream1flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool4_stream2flow"
  type: "Pooling"
  bottom: "conv4_3_stream2flow"
  top: "pool4_stream2flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool4_stream3flow"
  type: "Pooling"
  bottom: "conv4_3_stream3flow"
  top: "pool4_stream3flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool4_stream4flow"
  type: "Pooling"
  bottom: "conv4_3_stream4flow"
  top: "pool4_stream4flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool4_stream5flow"
  type: "Pooling"
  bottom: "conv4_3_stream5flow"
  top: "pool4_stream5flow"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1_stream0flow"
  type: "Convolution"
  bottom: "pool4_stream0flow"
  top: "conv5_1_stream0flow"
  param {
    name: "conv5_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_1_stream0flow"
  type: "ReLU"
  bottom: "conv5_1_stream0flow"
  top: "conv5_1_stream0flow"
}
layer {
  name: "conv5_1_stream1flow"
  type: "Convolution"
  bottom: "pool4_stream1flow"
  top: "conv5_1_stream1flow"
  param {
    name: "conv5_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_1_stream1flow"
  type: "ReLU"
  bottom: "conv5_1_stream1flow"
  top: "conv5_1_stream1flow"
}
layer {
  name: "conv5_1_stream2flow"
  type: "Convolution"
  bottom: "pool4_stream2flow"
  top: "conv5_1_stream2flow"
  param {
    name: "conv5_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_1_stream2flow"
  type: "ReLU"
  bottom: "conv5_1_stream2flow"
  top: "conv5_1_stream2flow"
}
layer {
  name: "conv5_1_stream3flow"
  type: "Convolution"
  bottom: "pool4_stream3flow"
  top: "conv5_1_stream3flow"
  param {
    name: "conv5_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_1_stream3flow"
  type: "ReLU"
  bottom: "conv5_1_stream3flow"
  top: "conv5_1_stream3flow"
}
layer {
  name: "conv5_1_stream4flow"
  type: "Convolution"
  bottom: "pool4_stream4flow"
  top: "conv5_1_stream4flow"
  param {
    name: "conv5_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_1_stream4flow"
  type: "ReLU"
  bottom: "conv5_1_stream4flow"
  top: "conv5_1_stream4flow"
}
layer {
  name: "conv5_1_stream5flow"
  type: "Convolution"
  bottom: "pool4_stream5flow"
  top: "conv5_1_stream5flow"
  param {
    name: "conv5_1flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_1flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_1_stream5flow"
  type: "ReLU"
  bottom: "conv5_1_stream5flow"
  top: "conv5_1_stream5flow"
}
layer {
  name: "conv5_2_stream0flow"
  type: "Convolution"
  bottom: "conv5_1_stream0flow"
  top: "conv5_2_stream0flow"
  param {
    name: "conv5_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_2_stream0flow"
  type: "ReLU"
  bottom: "conv5_2_stream0flow"
  top: "conv5_2_stream0flow"
}
layer {
  name: "conv5_2_stream1flow"
  type: "Convolution"
  bottom: "conv5_1_stream1flow"
  top: "conv5_2_stream1flow"
  param {
    name: "conv5_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_2_stream1flow"
  type: "ReLU"
  bottom: "conv5_2_stream1flow"
  top: "conv5_2_stream1flow"
}
layer {
  name: "conv5_2_stream2flow"
  type: "Convolution"
  bottom: "conv5_1_stream2flow"
  top: "conv5_2_stream2flow"
  param {
    name: "conv5_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_2_stream2flow"
  type: "ReLU"
  bottom: "conv5_2_stream2flow"
  top: "conv5_2_stream2flow"
}
layer {
  name: "conv5_2_stream3flow"
  type: "Convolution"
  bottom: "conv5_1_stream3flow"
  top: "conv5_2_stream3flow"
  param {
    name: "conv5_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_2_stream3flow"
  type: "ReLU"
  bottom: "conv5_2_stream3flow"
  top: "conv5_2_stream3flow"
}
layer {
  name: "conv5_2_stream4flow"
  type: "Convolution"
  bottom: "conv5_1_stream4flow"
  top: "conv5_2_stream4flow"
  param {
    name: "conv5_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_2_stream4flow"
  type: "ReLU"
  bottom: "conv5_2_stream4flow"
  top: "conv5_2_stream4flow"
}
layer {
  name: "conv5_2_stream5flow"
  type: "Convolution"
  bottom: "conv5_1_stream5flow"
  top: "conv5_2_stream5flow"
  param {
    name: "conv5_2flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_2flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_2_stream5flow"
  type: "ReLU"
  bottom: "conv5_2_stream5flow"
  top: "conv5_2_stream5flow"
}
layer {
  name: "conv5_3_stream0flow"
  type: "Convolution"
  bottom: "conv5_2_stream0flow"
  top: "conv5_3_stream0flow"
  param {
    name: "conv5_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_3_stream0flow"
  type: "ReLU"
  bottom: "conv5_3_stream0flow"
  top: "conv5_3_stream0flow"
}
layer {
  name: "conv5_3_stream1flow"
  type: "Convolution"
  bottom: "conv5_2_stream1flow"
  top: "conv5_3_stream1flow"
  param {
    name: "conv5_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_3_stream1flow"
  type: "ReLU"
  bottom: "conv5_3_stream1flow"
  top: "conv5_3_stream1flow"
}
layer {
  name: "conv5_3_stream2flow"
  type: "Convolution"
  bottom: "conv5_2_stream2flow"
  top: "conv5_3_stream2flow"
  param {
    name: "conv5_3flow_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_3flow_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_3_stream2flow"
  type: "ReLU"
  bottom: "conv5_3_stream2flow"
  top: "conv5_3_stream2flow"
}
layer {
  name: "conv5_3_stream3flow"
  type: "Convolution"
  bottom: "conv5_2_stream3flow"
  top: "conv5_3_stream3flow"
  param {
    name: "conv5_3flow_w"
