name: "ACTdetector_JHMDB3_RGB_train"
layer {
  name: "data"
  type: "Python"
  top: "data_stream0"
  top: "data_stream1"
  top: "data_stream2"
  top: "data_stream3"
  top: "data_stream4"
  top: "data_stream5"
  top: "label"
  include {
    phase: TRAIN
  }
  python_param {
    module: "ACT_datalayer"
    layer: "MultiframesLayer"
    param_str: "{\"dataset_name\": \"JHMDB3\", \"K\": 6, \"batch_size\": 5, \"resize_height\": 300, \"resize_width\": 300, \"restart_iter\": 0, \"flow\": False, \"ninput\": 1}"
  }
}
layer {
  name: "conv1_1_stream0"
  type: "Convolution"
  bottom: "data_stream0"
  top: "conv1_1_stream0"
  param {
    name: "conv1_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv1_1_stream1"
  type: "Convolution"
  bottom: "data_stream1"
  top: "conv1_1_stream1"
  param {
    name: "conv1_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv1_1_stream2"
  type: "Convolution"
  bottom: "data_stream2"
  top: "conv1_1_stream2"
  param {
    name: "conv1_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv1_1_stream3"
  type: "Convolution"
  bottom: "data_stream3"
  top: "conv1_1_stream3"
  param {
    name: "conv1_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv1_1_stream4"
  type: "Convolution"
  bottom: "data_stream4"
  top: "conv1_1_stream4"
  param {
    name: "conv1_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv1_1_stream5"
  type: "Convolution"
  bottom: "data_stream5"
  top: "conv1_1_stream5"
  param {
    name: "conv1_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_1_stream0"
  type: "ReLU"
  bottom: "conv1_1_stream0"
  top: "conv1_1_stream0"
}
layer {
  name: "conv1_2_stream0"
  type: "Convolution"
  bottom: "conv1_1_stream0"
  top: "conv1_2_stream0"
  param {
    name: "conv1_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_2_stream0"
  type: "ReLU"
  bottom: "conv1_2_stream0"
  top: "conv1_2_stream0"
}
layer {
  name: "relu1_1_stream1"
  type: "ReLU"
  bottom: "conv1_1_stream1"
  top: "conv1_1_stream1"
}
layer {
  name: "conv1_2_stream1"
  type: "Convolution"
  bottom: "conv1_1_stream1"
  top: "conv1_2_stream1"
  param {
    name: "conv1_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_2_stream1"
  type: "ReLU"
  bottom: "conv1_2_stream1"
  top: "conv1_2_stream1"
}
layer {
  name: "relu1_1_stream2"
  type: "ReLU"
  bottom: "conv1_1_stream2"
  top: "conv1_1_stream2"
}
layer {
  name: "conv1_2_stream2"
  type: "Convolution"
  bottom: "conv1_1_stream2"
  top: "conv1_2_stream2"
  param {
    name: "conv1_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_2_stream2"
  type: "ReLU"
  bottom: "conv1_2_stream2"
  top: "conv1_2_stream2"
}
layer {
  name: "relu1_1_stream3"
  type: "ReLU"
  bottom: "conv1_1_stream3"
  top: "conv1_1_stream3"
}
layer {
  name: "conv1_2_stream3"
  type: "Convolution"
  bottom: "conv1_1_stream3"
  top: "conv1_2_stream3"
  param {
    name: "conv1_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_2_stream3"
  type: "ReLU"
  bottom: "conv1_2_stream3"
  top: "conv1_2_stream3"
}
layer {
  name: "relu1_1_stream4"
  type: "ReLU"
  bottom: "conv1_1_stream4"
  top: "conv1_1_stream4"
}
layer {
  name: "conv1_2_stream4"
  type: "Convolution"
  bottom: "conv1_1_stream4"
  top: "conv1_2_stream4"
  param {
    name: "conv1_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_2_stream4"
  type: "ReLU"
  bottom: "conv1_2_stream4"
  top: "conv1_2_stream4"
}
layer {
  name: "relu1_1_stream5"
  type: "ReLU"
  bottom: "conv1_1_stream5"
  top: "conv1_1_stream5"
}
layer {
  name: "conv1_2_stream5"
  type: "Convolution"
  bottom: "conv1_1_stream5"
  top: "conv1_2_stream5"
  param {
    name: "conv1_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv1_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_2_stream5"
  type: "ReLU"
  bottom: "conv1_2_stream5"
  top: "conv1_2_stream5"
}
layer {
  name: "pool1_stream0"
  type: "Pooling"
  bottom: "conv1_2_stream0"
  top: "pool1_stream0"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool1_stream1"
  type: "Pooling"
  bottom: "conv1_2_stream1"
  top: "pool1_stream1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool1_stream2"
  type: "Pooling"
  bottom: "conv1_2_stream2"
  top: "pool1_stream2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool1_stream3"
  type: "Pooling"
  bottom: "conv1_2_stream3"
  top: "pool1_stream3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool1_stream4"
  type: "Pooling"
  bottom: "conv1_2_stream4"
  top: "pool1_stream4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool1_stream5"
  type: "Pooling"
  bottom: "conv1_2_stream5"
  top: "pool1_stream5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1_stream0"
  type: "Convolution"
  bottom: "pool1_stream0"
  top: "conv2_1_stream0"
  param {
    name: "conv2_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1_stream0"
  type: "ReLU"
  bottom: "conv2_1_stream0"
  top: "conv2_1_stream0"
}
layer {
  name: "conv2_1_stream1"
  type: "Convolution"
  bottom: "pool1_stream1"
  top: "conv2_1_stream1"
  param {
    name: "conv2_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1_stream1"
  type: "ReLU"
  bottom: "conv2_1_stream1"
  top: "conv2_1_stream1"
}
layer {
  name: "conv2_1_stream2"
  type: "Convolution"
  bottom: "pool1_stream2"
  top: "conv2_1_stream2"
  param {
    name: "conv2_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1_stream2"
  type: "ReLU"
  bottom: "conv2_1_stream2"
  top: "conv2_1_stream2"
}
layer {
  name: "conv2_1_stream3"
  type: "Convolution"
  bottom: "pool1_stream3"
  top: "conv2_1_stream3"
  param {
    name: "conv2_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1_stream3"
  type: "ReLU"
  bottom: "conv2_1_stream3"
  top: "conv2_1_stream3"
}
layer {
  name: "conv2_1_stream4"
  type: "Convolution"
  bottom: "pool1_stream4"
  top: "conv2_1_stream4"
  param {
    name: "conv2_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1_stream4"
  type: "ReLU"
  bottom: "conv2_1_stream4"
  top: "conv2_1_stream4"
}
layer {
  name: "conv2_1_stream5"
  type: "Convolution"
  bottom: "pool1_stream5"
  top: "conv2_1_stream5"
  param {
    name: "conv2_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1_stream5"
  type: "ReLU"
  bottom: "conv2_1_stream5"
  top: "conv2_1_stream5"
}
layer {
  name: "conv2_2_stream0"
  type: "Convolution"
  bottom: "conv2_1_stream0"
  top: "conv2_2_stream0"
  param {
    name: "conv2_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_2_stream0"
  type: "ReLU"
  bottom: "conv2_2_stream0"
  top: "conv2_2_stream0"
}
layer {
  name: "conv2_2_stream1"
  type: "Convolution"
  bottom: "conv2_1_stream1"
  top: "conv2_2_stream1"
  param {
    name: "conv2_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_2_stream1"
  type: "ReLU"
  bottom: "conv2_2_stream1"
  top: "conv2_2_stream1"
}
layer {
  name: "conv2_2_stream2"
  type: "Convolution"
  bottom: "conv2_1_stream2"
  top: "conv2_2_stream2"
  param {
    name: "conv2_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_2_stream2"
  type: "ReLU"
  bottom: "conv2_2_stream2"
  top: "conv2_2_stream2"
}
layer {
  name: "conv2_2_stream3"
  type: "Convolution"
  bottom: "conv2_1_stream3"
  top: "conv2_2_stream3"
  param {
    name: "conv2_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_2_stream3"
  type: "ReLU"
  bottom: "conv2_2_stream3"
  top: "conv2_2_stream3"
}
layer {
  name: "conv2_2_stream4"
  type: "Convolution"
  bottom: "conv2_1_stream4"
  top: "conv2_2_stream4"
  param {
    name: "conv2_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_2_stream4"
  type: "ReLU"
  bottom: "conv2_2_stream4"
  top: "conv2_2_stream4"
}
layer {
  name: "conv2_2_stream5"
  type: "Convolution"
  bottom: "conv2_1_stream5"
  top: "conv2_2_stream5"
  param {
    name: "conv2_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv2_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_2_stream5"
  type: "ReLU"
  bottom: "conv2_2_stream5"
  top: "conv2_2_stream5"
}
layer {
  name: "pool2_stream0"
  type: "Pooling"
  bottom: "conv2_2_stream0"
  top: "pool2_stream0"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool2_stream1"
  type: "Pooling"
  bottom: "conv2_2_stream1"
  top: "pool2_stream1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool2_stream2"
  type: "Pooling"
  bottom: "conv2_2_stream2"
  top: "pool2_stream2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool2_stream3"
  type: "Pooling"
  bottom: "conv2_2_stream3"
  top: "pool2_stream3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool2_stream4"
  type: "Pooling"
  bottom: "conv2_2_stream4"
  top: "pool2_stream4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool2_stream5"
  type: "Pooling"
  bottom: "conv2_2_stream5"
  top: "pool2_stream5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1_stream0"
  type: "Convolution"
  bottom: "pool2_stream0"
  top: "conv3_1_stream0"
  param {
    name: "conv3_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1_stream0"
  type: "ReLU"
  bottom: "conv3_1_stream0"
  top: "conv3_1_stream0"
}
layer {
  name: "conv3_1_stream1"
  type: "Convolution"
  bottom: "pool2_stream1"
  top: "conv3_1_stream1"
  param {
    name: "conv3_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1_stream1"
  type: "ReLU"
  bottom: "conv3_1_stream1"
  top: "conv3_1_stream1"
}
layer {
  name: "conv3_1_stream2"
  type: "Convolution"
  bottom: "pool2_stream2"
  top: "conv3_1_stream2"
  param {
    name: "conv3_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1_stream2"
  type: "ReLU"
  bottom: "conv3_1_stream2"
  top: "conv3_1_stream2"
}
layer {
  name: "conv3_1_stream3"
  type: "Convolution"
  bottom: "pool2_stream3"
  top: "conv3_1_stream3"
  param {
    name: "conv3_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1_stream3"
  type: "ReLU"
  bottom: "conv3_1_stream3"
  top: "conv3_1_stream3"
}
layer {
  name: "conv3_1_stream4"
  type: "Convolution"
  bottom: "pool2_stream4"
  top: "conv3_1_stream4"
  param {
    name: "conv3_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1_stream4"
  type: "ReLU"
  bottom: "conv3_1_stream4"
  top: "conv3_1_stream4"
}
layer {
  name: "conv3_1_stream5"
  type: "Convolution"
  bottom: "pool2_stream5"
  top: "conv3_1_stream5"
  param {
    name: "conv3_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1_stream5"
  type: "ReLU"
  bottom: "conv3_1_stream5"
  top: "conv3_1_stream5"
}
layer {
  name: "conv3_2_stream0"
  type: "Convolution"
  bottom: "conv3_1_stream0"
  top: "conv3_2_stream0"
  param {
    name: "conv3_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2_stream0"
  type: "ReLU"
  bottom: "conv3_2_stream0"
  top: "conv3_2_stream0"
}
layer {
  name: "conv3_2_stream1"
  type: "Convolution"
  bottom: "conv3_1_stream1"
  top: "conv3_2_stream1"
  param {
    name: "conv3_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2_stream1"
  type: "ReLU"
  bottom: "conv3_2_stream1"
  top: "conv3_2_stream1"
}
layer {
  name: "conv3_2_stream2"
  type: "Convolution"
  bottom: "conv3_1_stream2"
  top: "conv3_2_stream2"
  param {
    name: "conv3_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2_stream2"
  type: "ReLU"
  bottom: "conv3_2_stream2"
  top: "conv3_2_stream2"
}
layer {
  name: "conv3_2_stream3"
  type: "Convolution"
  bottom: "conv3_1_stream3"
  top: "conv3_2_stream3"
  param {
    name: "conv3_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2_stream3"
  type: "ReLU"
  bottom: "conv3_2_stream3"
  top: "conv3_2_stream3"
}
layer {
  name: "conv3_2_stream4"
  type: "Convolution"
  bottom: "conv3_1_stream4"
  top: "conv3_2_stream4"
  param {
    name: "conv3_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2_stream4"
  type: "ReLU"
  bottom: "conv3_2_stream4"
  top: "conv3_2_stream4"
}
layer {
  name: "conv3_2_stream5"
  type: "Convolution"
  bottom: "conv3_1_stream5"
  top: "conv3_2_stream5"
  param {
    name: "conv3_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2_stream5"
  type: "ReLU"
  bottom: "conv3_2_stream5"
  top: "conv3_2_stream5"
}
layer {
  name: "conv3_3_stream0"
  type: "Convolution"
  bottom: "conv3_2_stream0"
  top: "conv3_3_stream0"
  param {
    name: "conv3_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_3_stream0"
  type: "ReLU"
  bottom: "conv3_3_stream0"
  top: "conv3_3_stream0"
}
layer {
  name: "conv3_3_stream1"
  type: "Convolution"
  bottom: "conv3_2_stream1"
  top: "conv3_3_stream1"
  param {
    name: "conv3_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_3_stream1"
  type: "ReLU"
  bottom: "conv3_3_stream1"
  top: "conv3_3_stream1"
}
layer {
  name: "conv3_3_stream2"
  type: "Convolution"
  bottom: "conv3_2_stream2"
  top: "conv3_3_stream2"
  param {
    name: "conv3_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_3_stream2"
  type: "ReLU"
  bottom: "conv3_3_stream2"
  top: "conv3_3_stream2"
}
layer {
  name: "conv3_3_stream3"
  type: "Convolution"
  bottom: "conv3_2_stream3"
  top: "conv3_3_stream3"
  param {
    name: "conv3_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_3_stream3"
  type: "ReLU"
  bottom: "conv3_3_stream3"
  top: "conv3_3_stream3"
}
layer {
  name: "conv3_3_stream4"
  type: "Convolution"
  bottom: "conv3_2_stream4"
  top: "conv3_3_stream4"
  param {
    name: "conv3_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_3_stream4"
  type: "ReLU"
  bottom: "conv3_3_stream4"
  top: "conv3_3_stream4"
}
layer {
  name: "conv3_3_stream5"
  type: "Convolution"
  bottom: "conv3_2_stream5"
  top: "conv3_3_stream5"
  param {
    name: "conv3_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv3_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_3_stream5"
  type: "ReLU"
  bottom: "conv3_3_stream5"
  top: "conv3_3_stream5"
}
layer {
  name: "pool3_stream0"
  type: "Pooling"
  bottom: "conv3_3_stream0"
  top: "pool3_stream0"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool3_stream1"
  type: "Pooling"
  bottom: "conv3_3_stream1"
  top: "pool3_stream1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool3_stream2"
  type: "Pooling"
  bottom: "conv3_3_stream2"
  top: "pool3_stream2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool3_stream3"
  type: "Pooling"
  bottom: "conv3_3_stream3"
  top: "pool3_stream3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool3_stream4"
  type: "Pooling"
  bottom: "conv3_3_stream4"
  top: "pool3_stream4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool3_stream5"
  type: "Pooling"
  bottom: "conv3_3_stream5"
  top: "pool3_stream5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1_stream0"
  type: "Convolution"
  bottom: "pool3_stream0"
  top: "conv4_1_stream0"
  param {
    name: "conv4_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1_stream0"
  type: "ReLU"
  bottom: "conv4_1_stream0"
  top: "conv4_1_stream0"
}
layer {
  name: "conv4_1_stream1"
  type: "Convolution"
  bottom: "pool3_stream1"
  top: "conv4_1_stream1"
  param {
    name: "conv4_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1_stream1"
  type: "ReLU"
  bottom: "conv4_1_stream1"
  top: "conv4_1_stream1"
}
layer {
  name: "conv4_1_stream2"
  type: "Convolution"
  bottom: "pool3_stream2"
  top: "conv4_1_stream2"
  param {
    name: "conv4_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1_stream2"
  type: "ReLU"
  bottom: "conv4_1_stream2"
  top: "conv4_1_stream2"
}
layer {
  name: "conv4_1_stream3"
  type: "Convolution"
  bottom: "pool3_stream3"
  top: "conv4_1_stream3"
  param {
    name: "conv4_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1_stream3"
  type: "ReLU"
  bottom: "conv4_1_stream3"
  top: "conv4_1_stream3"
}
layer {
  name: "conv4_1_stream4"
  type: "Convolution"
  bottom: "pool3_stream4"
  top: "conv4_1_stream4"
  param {
    name: "conv4_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1_stream4"
  type: "ReLU"
  bottom: "conv4_1_stream4"
  top: "conv4_1_stream4"
}
layer {
  name: "conv4_1_stream5"
  type: "Convolution"
  bottom: "pool3_stream5"
  top: "conv4_1_stream5"
  param {
    name: "conv4_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1_stream5"
  type: "ReLU"
  bottom: "conv4_1_stream5"
  top: "conv4_1_stream5"
}
layer {
  name: "conv4_2_stream0"
  type: "Convolution"
  bottom: "conv4_1_stream0"
  top: "conv4_2_stream0"
  param {
    name: "conv4_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2_stream0"
  type: "ReLU"
  bottom: "conv4_2_stream0"
  top: "conv4_2_stream0"
}
layer {
  name: "conv4_2_stream1"
  type: "Convolution"
  bottom: "conv4_1_stream1"
  top: "conv4_2_stream1"
  param {
    name: "conv4_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2_stream1"
  type: "ReLU"
  bottom: "conv4_2_stream1"
  top: "conv4_2_stream1"
}
layer {
  name: "conv4_2_stream2"
  type: "Convolution"
  bottom: "conv4_1_stream2"
  top: "conv4_2_stream2"
  param {
    name: "conv4_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2_stream2"
  type: "ReLU"
  bottom: "conv4_2_stream2"
  top: "conv4_2_stream2"
}
layer {
  name: "conv4_2_stream3"
  type: "Convolution"
  bottom: "conv4_1_stream3"
  top: "conv4_2_stream3"
  param {
    name: "conv4_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2_stream3"
  type: "ReLU"
  bottom: "conv4_2_stream3"
  top: "conv4_2_stream3"
}
layer {
  name: "conv4_2_stream4"
  type: "Convolution"
  bottom: "conv4_1_stream4"
  top: "conv4_2_stream4"
  param {
    name: "conv4_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2_stream4"
  type: "ReLU"
  bottom: "conv4_2_stream4"
  top: "conv4_2_stream4"
}
layer {
  name: "conv4_2_stream5"
  type: "Convolution"
  bottom: "conv4_1_stream5"
  top: "conv4_2_stream5"
  param {
    name: "conv4_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2_stream5"
  type: "ReLU"
  bottom: "conv4_2_stream5"
  top: "conv4_2_stream5"
}
layer {
  name: "conv4_3_stream0"
  type: "Convolution"
  bottom: "conv4_2_stream0"
  top: "conv4_3_stream0"
  param {
    name: "conv4_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_3_stream0"
  type: "ReLU"
  bottom: "conv4_3_stream0"
  top: "conv4_3_stream0"
}
layer {
  name: "conv4_3_stream1"
  type: "Convolution"
  bottom: "conv4_2_stream1"
  top: "conv4_3_stream1"
  param {
    name: "conv4_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_3_stream1"
  type: "ReLU"
  bottom: "conv4_3_stream1"
  top: "conv4_3_stream1"
}
layer {
  name: "conv4_3_stream2"
  type: "Convolution"
  bottom: "conv4_2_stream2"
  top: "conv4_3_stream2"
  param {
    name: "conv4_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_3_stream2"
  type: "ReLU"
  bottom: "conv4_3_stream2"
  top: "conv4_3_stream2"
}
layer {
  name: "conv4_3_stream3"
  type: "Convolution"
  bottom: "conv4_2_stream3"
  top: "conv4_3_stream3"
  param {
    name: "conv4_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_3_stream3"
  type: "ReLU"
  bottom: "conv4_3_stream3"
  top: "conv4_3_stream3"
}
layer {
  name: "conv4_3_stream4"
  type: "Convolution"
  bottom: "conv4_2_stream4"
  top: "conv4_3_stream4"
  param {
    name: "conv4_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_3_stream4"
  type: "ReLU"
  bottom: "conv4_3_stream4"
  top: "conv4_3_stream4"
}
layer {
  name: "conv4_3_stream5"
  type: "Convolution"
  bottom: "conv4_2_stream5"
  top: "conv4_3_stream5"
  param {
    name: "conv4_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv4_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_3_stream5"
  type: "ReLU"
  bottom: "conv4_3_stream5"
  top: "conv4_3_stream5"
}
layer {
  name: "pool4_stream0"
  type: "Pooling"
  bottom: "conv4_3_stream0"
  top: "pool4_stream0"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool4_stream1"
  type: "Pooling"
  bottom: "conv4_3_stream1"
  top: "pool4_stream1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool4_stream2"
  type: "Pooling"
  bottom: "conv4_3_stream2"
  top: "pool4_stream2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool4_stream3"
  type: "Pooling"
  bottom: "conv4_3_stream3"
  top: "pool4_stream3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool4_stream4"
  type: "Pooling"
  bottom: "conv4_3_stream4"
  top: "pool4_stream4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool4_stream5"
  type: "Pooling"
  bottom: "conv4_3_stream5"
  top: "pool4_stream5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1_stream0"
  type: "Convolution"
  bottom: "pool4_stream0"
  top: "conv5_1_stream0"
  param {
    name: "conv5_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_1_stream0"
  type: "ReLU"
  bottom: "conv5_1_stream0"
  top: "conv5_1_stream0"
}
layer {
  name: "conv5_1_stream1"
  type: "Convolution"
  bottom: "pool4_stream1"
  top: "conv5_1_stream1"
  param {
    name: "conv5_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_1_stream1"
  type: "ReLU"
  bottom: "conv5_1_stream1"
  top: "conv5_1_stream1"
}
layer {
  name: "conv5_1_stream2"
  type: "Convolution"
  bottom: "pool4_stream2"
  top: "conv5_1_stream2"
  param {
    name: "conv5_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_1_stream2"
  type: "ReLU"
  bottom: "conv5_1_stream2"
  top: "conv5_1_stream2"
}
layer {
  name: "conv5_1_stream3"
  type: "Convolution"
  bottom: "pool4_stream3"
  top: "conv5_1_stream3"
  param {
    name: "conv5_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_1_stream3"
  type: "ReLU"
  bottom: "conv5_1_stream3"
  top: "conv5_1_stream3"
}
layer {
  name: "conv5_1_stream4"
  type: "Convolution"
  bottom: "pool4_stream4"
  top: "conv5_1_stream4"
  param {
    name: "conv5_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_1_stream4"
  type: "ReLU"
  bottom: "conv5_1_stream4"
  top: "conv5_1_stream4"
}
layer {
  name: "conv5_1_stream5"
  type: "Convolution"
  bottom: "pool4_stream5"
  top: "conv5_1_stream5"
  param {
    name: "conv5_1_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_1_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_1_stream5"
  type: "ReLU"
  bottom: "conv5_1_stream5"
  top: "conv5_1_stream5"
}
layer {
  name: "conv5_2_stream0"
  type: "Convolution"
  bottom: "conv5_1_stream0"
  top: "conv5_2_stream0"
  param {
    name: "conv5_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_2_stream0"
  type: "ReLU"
  bottom: "conv5_2_stream0"
  top: "conv5_2_stream0"
}
layer {
  name: "conv5_2_stream1"
  type: "Convolution"
  bottom: "conv5_1_stream1"
  top: "conv5_2_stream1"
  param {
    name: "conv5_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_2_stream1"
  type: "ReLU"
  bottom: "conv5_2_stream1"
  top: "conv5_2_stream1"
}
layer {
  name: "conv5_2_stream2"
  type: "Convolution"
  bottom: "conv5_1_stream2"
  top: "conv5_2_stream2"
  param {
    name: "conv5_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_2_stream2"
  type: "ReLU"
  bottom: "conv5_2_stream2"
  top: "conv5_2_stream2"
}
layer {
  name: "conv5_2_stream3"
  type: "Convolution"
  bottom: "conv5_1_stream3"
  top: "conv5_2_stream3"
  param {
    name: "conv5_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_2_stream3"
  type: "ReLU"
  bottom: "conv5_2_stream3"
  top: "conv5_2_stream3"
}
layer {
  name: "conv5_2_stream4"
  type: "Convolution"
  bottom: "conv5_1_stream4"
  top: "conv5_2_stream4"
  param {
    name: "conv5_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_2_stream4"
  type: "ReLU"
  bottom: "conv5_2_stream4"
  top: "conv5_2_stream4"
}
layer {
  name: "conv5_2_stream5"
  type: "Convolution"
  bottom: "conv5_1_stream5"
  top: "conv5_2_stream5"
  param {
    name: "conv5_2_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_2_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_2_stream5"
  type: "ReLU"
  bottom: "conv5_2_stream5"
  top: "conv5_2_stream5"
}
layer {
  name: "conv5_3_stream0"
  type: "Convolution"
  bottom: "conv5_2_stream0"
  top: "conv5_3_stream0"
  param {
    name: "conv5_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_3_stream0"
  type: "ReLU"
  bottom: "conv5_3_stream0"
  top: "conv5_3_stream0"
}
layer {
  name: "conv5_3_stream1"
  type: "Convolution"
  bottom: "conv5_2_stream1"
  top: "conv5_3_stream1"
  param {
    name: "conv5_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_3_stream1"
  type: "ReLU"
  bottom: "conv5_3_stream1"
  top: "conv5_3_stream1"
}
layer {
  name: "conv5_3_stream2"
  type: "Convolution"
  bottom: "conv5_2_stream2"
  top: "conv5_3_stream2"
  param {
    name: "conv5_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_3_stream2"
  type: "ReLU"
  bottom: "conv5_3_stream2"
  top: "conv5_3_stream2"
}
layer {
  name: "conv5_3_stream3"
  type: "Convolution"
  bottom: "conv5_2_stream3"
  top: "conv5_3_stream3"
  param {
    name: "conv5_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_3_stream3"
  type: "ReLU"
  bottom: "conv5_3_stream3"
  top: "conv5_3_stream3"
}
layer {
  name: "conv5_3_stream4"
  type: "Convolution"
  bottom: "conv5_2_stream4"
  top: "conv5_3_stream4"
  param {
    name: "conv5_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_3_stream4"
  type: "ReLU"
  bottom: "conv5_3_stream4"
  top: "conv5_3_stream4"
}
layer {
  name: "conv5_3_stream5"
  type: "Convolution"
  bottom: "conv5_2_stream5"
  top: "conv5_3_stream5"
  param {
    name: "conv5_3_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "conv5_3_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 1
  }
}
layer {
  name: "relu5_3_stream5"
  type: "ReLU"
  bottom: "conv5_3_stream5"
  top: "conv5_3_stream5"
}
layer {
  name: "pool5_stream0"
  type: "Pooling"
  bottom: "conv5_3_stream0"
  top: "pool5_stream0"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 1
  }
}
layer {
  name: "fc6_stream0"
  type: "Convolution"
  bottom: "pool5_stream0"
  top: "fc6_stream0"
  param {
    name: "fc6_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "fc6_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 6
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 6
  }
}
layer {
  name: "relu6_stream0"
  type: "ReLU"
  bottom: "fc6_stream0"
  top: "fc6_stream0"
}
layer {
  name: "fc7_stream0"
  type: "Convolution"
  bottom: "fc6_stream0"
  top: "fc7_stream0"
  param {
    name: "fc7_w"
    lr_mult: 0.166666666667
    decay_mult: 1
  }
  param {
    name: "fc7_b"
    lr_mult: 0.333333333333
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
